Revit 2027 API
StartingViewSettings.ViewId Property
 Indicates the specific view that will be opened when the model is loaded. InvalidElementId indicates that no view has been specified. In that case, Revit will open the last views that were open at the time the file was saved.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ViewId { get; set; }
Public Property ViewId As ElementId
	Get
	Set
public:
property ElementId^ ViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ViewId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: viewId is not an acceptable starting view for this model.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 Note that InvalidElementId will cause Revit to open the same view it would have used in Revit 2011 and prior releases.
See Also
Reference
StartingViewSettings Class
Autodesk.Revit.DB Namespace